In [2]:
import pandas as pd

In [4]:
import numpy as np

In [3]:
df = pd.read_csv("insurance.csv")

In [3]:
df.head()  #first five rows of the dataset

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [4]:
df.tail()   # last five rows of the dataset

      age     sex    bmi  children smoker     region     charges
1333   50    male  30.97         3     no  northwest  10600.5483
1334   18  female  31.92         0     no  northeast   2205.9808
1335   18  female  36.85         0     no  southeast   1629.8335
1336   21  female  25.80         0     no  southwest   2007.9450
1337   61  female  29.07         0    yes  northwest  29141.3603

In [6]:
df.shape

(1338, 7)

In [ ]:
df.info() # gives you more general information about the dataset

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1338 non-null   int64
 1   sex       1338 non-null   object
 2   bmi       1338 non-null   float64
 3   children  1338 non-null   int64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(2), int64(2), object(3)
memory usage: 73.3+ KB

In [10]:
print(f"Here in this data set we have {df.shape[0]} rows and {df.shape[1]} columns")

Here in this data set we have 1338 rows and 7 columns

In [11]:
print(df['age'])   # selecting a column

0       19
1       18
2       28
3       33
4       32
        ..
1333    50
1334    18
1335    18
1336    21
1337    61
Name: age, Length: 1338, dtype: int64

In [4]:
df[["age","sex","bmi"]]   ## selecting multiple columns at the same time

      age     sex     bmi
0      19  female  27.900
1      18    male  33.770
2      28    male  33.000
3      33    male  22.705
4      32    male  28.880
...   ...     ...     ...
1333   50    male  30.970
1334   18  female  31.920
1335   18  female  36.850
1336   21  female  25.800
1337   61  female  29.070

[1338 rows x 3 columns]

In [5]:
df.loc [0]    ## selecting the first row with iloc

age                19
sex            female
bmi              27.9
children            0
smoker            yes
region      southwest
charges     16884.924
Name: 0, dtype: object

In [ ]:
df.loc [0,"bmi"]    ## selecting a row and a column at the same time with iloc

np.float64(27.9)

In [ ]:
df.loc[df["age"]> 63]   ## selecting rows based on a condition

      age     sex     bmi  children smoker     region      charges
62     64    male  24.700         1     no  northwest  30166.61817
94     64  female  31.300         2    yes  southwest  47291.05500
199    64  female  39.330         0     no  northeast  14901.51670
328    64  female  33.800         1    yes  southwest  47928.03000
335    64    male  34.500         0     no  southwest  13822.80300
378    64  female  30.115         3     no  northwest  16455.70785
398    64    male  25.600         2     no  southwest  14988.43200
402    64  female  32.965         0     no  northwest  14692.66935
418    64    male  39.160         1     no  southeast  14418.28040
420    64    male  33.880         0    yes  southeast  46889.26120
534    64    male  40.480         0     no  southeast  13831.11520
603    64  female  39.050         3     no  southeast  16085.12750
635    64    male  38.190         0     no  northeast  14410.93210
664    64  female  22.990         0    yes  southeast  27037.91410
752    64    male  37.905         0     no  northwest  14210.53595
768    64  female  39.700         0     no  southwest  14319.03100
801    64  female  35.970         0     no  southeast  14313.84630
825    64  female  31.825         2     no  northeast  16069.08475
890    64  female  26.885         0    yes  northwest  29330.98315
1051   64    male  26.410         0     no  northeast  14394.55790
1241   64    male  36.960         2    yes  southeast  49577.66240
1265   64    male  23.760         0    yes  southeast  26926.51440

In [9]:
df.loc[(df["age"] > 30) & (df["sex"] == "male")]  ## selection using two conditions

      age   sex     bmi  children smoker     region      charges
3      33  male  22.705         0     no  northwest  21984.47061
4      32  male  28.880         0     no  northwest   3866.85520
8      37  male  29.830         2     no  northeast   6406.41070
18     56  male  40.300         0     no  southwest  10602.38500
24     37  male  28.025         2     no  northwest   6203.90175
...   ...   ...     ...       ...    ...        ...          ...
1324   31  male  25.935         1     no  northwest   4239.89265
1325   61  male  33.535         0     no  northeast  13143.33665
1327   51  male  30.030         1     no  southeast   9377.90470
1329   52  male  38.600         2     no  southwest  10325.20600
1333   50  male  30.970         3     no  northwest  10600.54830

[446 rows x 7 columns]

In [10]:
df.iloc[[10,3]]    ## iloc selects rows and columns based on index position unlike log that selects them based on position lables and names

    age   sex     bmi  children smoker     region      charges
10   25  male  26.220         0     no  northeast   2721.32080
3    33  male  22.705         0     no  northwest  21984.47061

In [14]:
print(df.iloc[10,4])   ## this code is selecting row 10 and column 4 unlike the code above it which is selecting two rows 10 and 3. The difference is due to having one or two pairs of brackets

no

In [5]:
df["Year_Analyzed"] = 2023  ## adding a column to the dataframe

In [ ]:
df["Overcharging"] = np.where(
    df["charges"] > 20000,
    "Yes",
    "No"
)     ## adding a column with conditions

In [ ]:
df.drop(columns = "Year_Analyzed")  ## this how you exclude a column but only for visualization purposes

,age,sex,bmi,children,smoker,region,charges,Overcharging
0,19,female,27.900,0,yes,southwest,16884.92400,No
1,18,male,33.770,1,no,southeast,1725.55230,No
2,28,male,33.000,3,no,southeast,4449.46200,No
3,33,male,22.705,0,no,northwest,21984.47061,Yes
4,32,male,28.880,0,no,northwest,3866.85520,No
...,...,...,...,...,...,...,...,...
1333,50,male,30.970,3,no,northwest,10600.54830,No
1334,18,female,31.920,0,no,northeast,2205.98080,No
1335,18,female,36.850,0,no,southeast,1629.83350,No
1336,21,female,25.800,0,no,southwest,2007.94500,No
1337,61,female,29.070,0,yes,northwest,29141.36030,Yes

In [9]:
df.drop(columns = "Year_Analyzed", inplace = True )  ## by using the inplace parameter we can truely remove the column

In [ ]:
df["Overcharging"] = df["Overcharging"].map({
    "Yes":1,
    "No": 0

})    ## this is how you can change the values of rows